app/views/article1s/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article1_id" = ?  [["article1_id", 19]]
---
	Tags:
			<% @article1.tags.each do |tag| %>