app/views/tags/show.html.erb

SELECT "article1s".* FROM "article1s" INNER JOIN "taggings" ON "article1s"."id" = "taggings"."article1_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 10]]
---
<ul>
  <% @tag.article1s.each do |article1| %>