app/controllers/article1s_controller.rb

	def show
		@article1 = Article1.find(params[:id])
---
SELECT  "article1s".* FROM "article1s" WHERE "article1s"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@article1 = Article1.find(params[:id])
---
SELECT  "article1s".* FROM "article1s" WHERE "article1s"."id" = ? LIMIT 1  [["id", 8]]

	def create
		@article1 = Article1.new(article1_params)
		respond_to do |format|
			if @article1.save
---
INSERT INTO "article1s" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "my titile"], ["body", "my body"], ["created_at", "2017-06-22 06:07:56.300896"], ["updated_at", "2017-06-22 06:07:56.300896"]]

	def update
		@article1 = Article1.find(params[:id])
		p @article1
		puts "before update"
		@article1.update(title: params[:article1][:title],
    		body: params[:article1][:body])
---
SELECT  "article1s".* FROM "article1s" WHERE "article1s"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "article1s" SET "title" = ?, "updated_at" = ? WHERE "article1s"."id" = ?  [["title", "abcd"], ["updated_at", "2017-06-22 07:00:06.985500"], ["id", 12]]

	def destroy
		puts "delete this object"
		Article1.destroy(params[:id])
---
DELETE FROM "article1s" WHERE "article1s"."id" = ?  [["id", 2]]