app/controllers/comments_controller.rb

	def create
		@comment =Comment.new(comment_params)
		@comment.article1_id = params[:article1_id]
		@comment.save
---
INSERT INTO "comments" ("author_name", "body", "article1_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "FIRST COMMENTER "], ["body", "YO YO YOY OY"], ["article1_id", 1], ["created_at", "2017-06-23 06:52:07.568392"], ["updated_at", "2017-06-23 06:52:07.568392"]]