app/controllers/venues_controller.rb

INSERT INTO "venues" ("place", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["place", "c"], ["location", "cx"], ["created_at", "2017-06-28 05:59:56.164660"], ["updated_at", "2017-06-28 05:59:56.164660"]]
---
  def create
    @venue = Venue.new(venue_params)

    respond_to do |format|
      if @venue.save

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_venue
      @venue = Venue.find(params[:id])